SIGNS = {(12,22,1,19):"Козирог",
         (1,20,2,18):"Водолей",
         (2,19,3,20):"Риби",
         (3,21,4,20):"Овен",
         (4,21,5,20):"Телец",
         (5,21,6,20):"Близнаци",
         (6,21,7,21):"Рак",
         (7,22,8,22):"Лъв",
         (8,23,9,22):"Дева",
         (9,23,10,22):"Везни",
         (10,23,11,21):"Скорпион",
         (11,22,12,21):"Стрелец"}

def what_is_my_sign(day, month):
    for tu in SIGNS:
        if (month == tu[0] and day >= tu[1] or
            month == tu[2] and day <= tu[3]):
            return SIGNS[tu]
